zhdjet/hc32f460/hc32f460_sdk/DeviceDriverLibrary/hc32f46x_ddl/example/adc/adc_13_adc1_adc2_sync/source/main.c
/*******************************************************************************
 * Copyright (C) 2016, Huada Semiconductor Co., Ltd. All rights reserved.
 *
 * This software is owned and published by:
 * Huada Semiconductor Co., Ltd. ("HDSC").
 *
 * BY DOWNLOADING, INSTALLING OR USING THIS SOFTWARE, YOU AGREE TO BE BOUND
 * BY ALL THE TERMS AND CONDITIONS OF THIS AGREEMENT.
 *
 * This software contains source code for use with HDSC
 * components. This software is licensed by HDSC to be adapted only
 * for use in systems utilizing HDSC components. HDSC shall not be
 * responsible for misuse or illegal use of this software for devices not
 * supported herein. HDSC is providing this software "AS IS" and will
 * not be responsible for issues arising from incorrect user implementation
 * of the software.
 *
 * Disclaimer:
 * HDSC MAKES NO WARRANTY, EXPRESS OR IMPLIED, ARISING BY LAW OR OTHERWISE,
 * REGARDING THE SOFTWARE (INCLUDING ANY ACCOMPANYING WRITTEN MATERIALS),
 * ITS PERFORMANCE OR SUITABILITY FOR YOUR INTENDED USE, INCLUDING,
 * WITHOUT LIMITATION, THE IMPLIED WARRANTY OF MERCHANTABILITY, THE IMPLIED
 * WARRANTY OF FITNESS FOR A PARTICULAR PURPOSE OR USE, AND THE IMPLIED
 * WARRANTY OF NONINFRINGEMENT.
 * HDSC SHALL HAVE NO LIABILITY (WHETHER IN CONTRACT, WARRANTY, TORT,
 * NEGLIGENCE OR OTHERWISE) FOR ANY DAMAGES WHATSOEVER (INCLUDING, WITHOUT
 * LIMITATION, DAMAGES FOR LOSS OF BUSINESS PROFITS, BUSINESS INTERRUPTION,
 * LOSS OF BUSINESS INFORMATION, OR OTHER PECUNIARY LOSS) ARISING FROM USE OR
 * INABILITY TO USE THE SOFTWARE, INCLUDING, WITHOUT LIMITATION, ANY DIRECT,
 * INDIRECT, INCIDENTAL, SPECIAL OR CONSEQUENTIAL DAMAGES OR LOSS OF DATA,
 * SAVINGS OR PROFITS,
 * EVEN IF Disclaimer HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
 * YOU ASSUME ALL RESPONSIBILITIES FOR SELECTION OF THE SOFTWARE TO ACHIEVE YOUR
 * INTENDED RESULTS, AND FOR THE INSTALLATION OF, USE OF, AND RESULTS OBTAINED
 * FROM, THE SOFTWARE.
 *
 * This software may be replicated in part or whole for the licensed use,
 * with the restriction that this Disclaimer and Copyright notice must be
 * included with each copy of this software, whether used in part or whole,
 * at all times.
 */
/******************************************************************************/
/** \file main.c
 **
 ** \brief ADC sample
 **
 **   - 2018-11-30  1.0  Wuze First version for Device Driver Library of
 **     ADC
 **
 ******************************************************************************/

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32_ddl.h"

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/
/*
 * If you remap the mapping between the channel and the pin with the function
 * ADC_ChannleRemap, define ADC_CH_REMAP as non-zero, otherwise define as 0.
 */
#define ADC_CH_REMAP                (0u)

/* The number of channels for ADC1 and ADC2 must be the same in sync mode. */
#define ADC_SYNC_CH_COUNT           (1u)

/* Select EVT_AOS_STRG as ADC1 sequence A trigger source. */
#define ADC_SYNC_TRG_EVENT          (EVT_AOS_STRG)

/*
 * All the channels must set the same sampling time in sync mode.
 * The sampling time depends on your hardware design.
 */
/* ADC1 channel definition for this example. */
#define ADC1_SA_CHANNEL             (ADC1_CH4)
#define ADC1_SA_CHANNEL_COUNT       (ADC_SYNC_CH_COUNT)

#define ADC1_CHANNEL                (ADC1_SA_CHANNEL)

#define ADC1_DMA_SRC_ADDR           ((uint32_t)(&M4_ADC1->DR4))

/* ADC1 channel sampling time.             ADC1_CH4   */
#define ADC1_SA_CHANNEL_SAMPLE_TIME { ADC_SYNC_SAMPLE_TIME }

/* ADC2 channel definition for this example. */
#define ADC2_SA_CHANNEL             (ADC2_CH0)
#define ADC2_SA_CHANNEL_COUNT       (ADC_SYNC_CH_COUNT)

#define ADC2_CHANNEL                (ADC2_SA_CHANNEL)

#define ADC2_DMA_SRC_ADDR           ((uint32_t)(&M4_ADC2->DR0))

/* ADC2 channel sampling time.             ADC2_CH0   */
#define ADC2_SA_CHANNEL_SAMPLE_TIME { ADC_SYNC_SAMPLE_TIME }

/* Synchronous mode selection definition. */
/*
 * SYNC_SINGLE_SERIAL:
 * ADC1 and ADC2 only work once after being triggered.
 * Mode AdcMode_SAOnce and AdcMode_SAContinuous are valid.
 * ADC2 start after ADC1 N PCLK4 cycles.
 */
#define SYNC_SINGLE_SERIAL          (0u)

/*
 * SYNC_SINGLE_PARALLEL:
 * ADC1 and ADC2 only work once after being triggered.
 * Mode AdcMode_SAOnce and AdcMode_SAContinuous are valid.
 * ADC1 and ADC2 start at the same time.
 * ADC1 and ADC2 CAN NOT select the same ADC pin.
 */
#define SYNC_SINGLE_PARALLEL        (2u)

/*
 * SYNC_CONTINUOUS_SERIAL:
 * ADC1 and ADC2 are always working after being triggered.
 * Mode AdcMode_SAOnce is valid.
 * ADC2 start after ADC1 N PCLK4 cycles.
 * ADC1 and ADC2 CAN NOT select the same ADC pin.
 */
#define SYNC_CONTINUOUS_SERIAL      (4u)

/*
 * SYNC_CONTINUOUS_PARALLEL:
 * ADC1 and ADC2 are always working after being triggered.
 * Mode AdcMode_SAOnce is valid.
 * ADC1 and ADC2 start at the same time.
 */
#define SYNC_CONTINUOUS_PARALLEL    (6u)

/* Select sync mode depending on your application. */
#define SYNC_MODE                   (SYNC_SINGLE_SERIAL)

/* Sequence A scan mode definition. It depends on SYNC_MODE. */
#if ((SYNC_MODE == SYNC_SINGLE_PARALLEL) || (SYNC_MODE == SYNC_SINGLE_SERIAL))
/* AdcMode_SAOnce and AdcMode_SAContinuous can be used. */
//#define SA_SCAN_MODE                (AdcMode_SAOnce)
#define SA_SCAN_MODE                (AdcMode_SAContinuous)
#elif ((SYNC_MODE == SYNC_CONTINUOUS_PARALLEL) || (SYNC_MODE == SYNC_CONTINUOUS_SERIAL))
/* Only AdcMode_SAOnce can be used. */
#define SA_SCAN_MODE                (AdcMode_SAOnce)
#else
#endif

#if (SYNC_MODE == SYNC_SINGLE_SERIAL)
/* ADC sampling time is 11 ADCLK cycles. */
#define ADC_SYNC_SAMPLE_TIME        (11u)

