zhdjet/hc32f460/hc32f460_sdk/DeviceDriverLibrary/hc32f46x_ddl/example/adc/adc_13_adc1_adc2_sync/source/main.c
/*
 * ADC_SYNC_DELAY_TIME definition depends on ADCLK, trigger source, etc.
 * See section 17.3.8 and 17.4.16 of user manual for details.
 */
#define ADC_SYNC_DELAY_TIME         (12u)

#elif (SYNC_MODE == SYNC_SINGLE_PARALLEL)
#define ADC_SYNC_SAMPLE_TIME        (11u)
#define ADC_SYNC_DELAY_TIME         (11u)

#elif (SYNC_MODE == SYNC_CONTINUOUS_SERIAL)
#define ADC_SYNC_SAMPLE_TIME        (11u)
#define ADC_SYNC_DELAY_TIME         (17u)

#elif (SYNC_MODE == SYNC_CONTINUOUS_PARALLEL)
#define ADC_SYNC_SAMPLE_TIME        (11u)
#define ADC_SYNC_DELAY_TIME         (40u)

#else
#endif // (SYNC_MODE == SYNC_SINGLE_SERIAL)

/* DMA definition for ADC1. */
#define ADC1_SA_DMA_UNIT            (M4_DMA2)
#define ADC1_SA_DMA_PWC             (PWC_FCG0_PERIPH_DMA2)
#define ADC1_SA_DMA_CH              (DmaCh3)
#define ADC1_SA_DMA_TRGSRC          (EVT_ADC1_EOCA)

/* DMA definition for ADC2. */
#define ADC2_SA_DMA_UNIT            (M4_DMA1)
#define ADC2_SA_DMA_PWC             (PWC_FCG0_PERIPH_DMA1)
#define ADC2_SA_DMA_CH              (DmaCh2)
#define ADC2_SA_DMA_TRGSRC          (EVT_ADC2_EOCA)

#define ADC_BUFFER_LENGTH           (512u)

/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/

/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/
static void SystemClockConfig(void);

static void AdcConfig(void);
static void AdcClockConfig(void);
static void AdcInitConfig(void);
static void AdcChannelConfig(void);
static void AdcTriggerConfig(void);
static void AdcSyncConfig(void);

static void AdcDmaConfig(void);

static void IndicatePinConfig(void);

static void AdcSetChannelPinMode(const M4_ADC_TypeDef *ADCx,
                                 uint32_t u32Channel,
                                 en_pin_mode_t enMode);
static void AdcSetPinMode(uint8_t u8AdcPin, en_pin_mode_t enMode);

/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/
static uint16_t m_au16Adc1SaValue[ADC_BUFFER_LENGTH];
static uint16_t m_au16Adc2SaValue[ADC_BUFFER_LENGTH];

/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/
/**
 *******************************************************************************
 ** \brief  Main function.
 **
 ** \param  None.
 **
 ** \retval int32_t return value, if needed.
 **
 ******************************************************************************/
int32_t main(void)
{
    /* Config a new system clock. */
    SystemClockConfig();

    /* Config ADCs. */
    AdcConfig();

    /*
     * Config indicate pins.
     * Its purpose is simply to indicate the sampling rate.
     */
    IndicatePinConfig();

    /***************** Configuration end, application start **************/
    AOS_SW_Trigger();

    while (1u)
    {
        // Your application code.
    }
}

/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/
/**
 *******************************************************************************
 ** \brief  Configuring a new system clock.
 **         System clock frequency: 168MHz.
 **         System clock source:    MPLL.
 **         MPLL clock source:      XTAL(8MHz).
 **
 ******************************************************************************/
static void SystemClockConfig(void)
{
    stc_sram_config_t    stcSramConfig;
    stc_clk_xtal_cfg_t   stcXtalCfg;
    stc_clk_mpll_cfg_t   stcMpllCfg;
    stc_clk_sysclk_cfg_t stcSysclkCfg =
    {
        /* Default system clock division. */
        .enHclkDiv  = ClkSysclkDiv1,  // 168MHz
        .enExclkDiv = ClkSysclkDiv2,  // 84MHz
        .enPclk0Div = ClkSysclkDiv1,  // 168MHz
        .enPclk1Div = ClkSysclkDiv2,  // 84MHz
        .enPclk2Div = ClkSysclkDiv4,  // 42MHz
        .enPclk3Div = ClkSysclkDiv4,  // 42MHz
        .enPclk4Div = ClkSysclkDiv2,  // 84MHz
    };

    MEM_ZERO_STRUCT(stcXtalCfg);
    MEM_ZERO_STRUCT(stcMpllCfg);

    /* Set bus clock division first. */
    CLK_SysClkConfig(&stcSysclkCfg);

    /* Switch system clock source to MPLL. */
    /* Use XTAL as MPLL source. */
    stcXtalCfg.enFastStartup = Enable;
    stcXtalCfg.enMode = ClkXtalModeOsc;
    stcXtalCfg.enDrv  = ClkXtalLowDrv;
    CLK_XtalConfig(&stcXtalCfg);
    CLK_XtalCmd(Enable);

    /* Set MPLL out 168MHz. */
    stcMpllCfg.pllmDiv = 1u;
    /* sysclk = 8M / pllmDiv * plln / PllpDiv */
    stcMpllCfg.plln    = 42u;
    stcMpllCfg.PllpDiv = 2u;
    stcMpllCfg.PllqDiv = 16u;
    stcMpllCfg.PllrDiv = 16u;
    CLK_SetPllSource(ClkPllSrcXTAL);
    CLK_MpllConfig(&stcMpllCfg);

    /* Flash read wait cycle setting. */
    EFM_Unlock();
    EFM_SetLatency(EFM_LATENCY_4);
    EFM_Lock();

    /* If the system clock frequency is higher than 100MHz and SRAM1, SRAM2, SRAM3 or Ret_SRAM is used,
       the wait cycle must be set. */
    stcSramConfig.u8SramIdx     = Sram12Idx | Sram3Idx | SramRetIdx;
    stcSramConfig.enSramRC      = SramCycle2;
    stcSramConfig.enSramWC      = SramCycle2;
    stcSramConfig.enSramEccMode = EccMode0;
    stcSramConfig.enSramEccOp   = SramNmi;
    stcSramConfig.enSramPyOp    = SramNmi;
    SRAM_Init(&stcSramConfig);

    CLK_MpllCmd(Enable);

    /* Wait MPLL ready. */
    while(Set != CLK_GetFlagStatus(ClkFlagMPLLRdy))
    {
        ;
    }

    /* Set system clock source. */
    CLK_SetSysClkSource(CLKSysSrcMPLL);
}

/**
 *******************************************************************************
 ** \brief  ADC configuration, including clock configuration, initial configuration
 **         and channel configuration, trigger source configuration, synchronous
 **         mode configuration and DMA configuration.
 **
 ** \param  None.
 **
 ** \retval None.
 **
 ******************************************************************************/
static void AdcConfig(void)
{
    AdcClockConfig();
    AdcInitConfig();
    AdcChannelConfig();
    AdcTriggerConfig();
    AdcSyncConfig();
    AdcDmaConfig();
}

/**
 *******************************************************************************
 ** \brief  ADC clock configuration. Configure UPLLR as ADC clock.
 **
 ** \note   1) ADCLK max frequency is 60MHz.
 **         2) If PCLK2 and PCLK4 are selected as the ADC clock,
 **            the following conditions must be met:
 **            a. ADCLK(PCLK2) max 60MHz;
 **            b. PCLK4 : ADCLK = 1:1, 2:1, 4:1, 8:1, 1:2, 1:4
 **
 ******************************************************************************/
static void AdcClockConfig(void)
{
    stc_clk_xtal_cfg_t stcXtalCfg;
    stc_clk_upll_cfg_t stcUpllCfg;

    MEM_ZERO_STRUCT(stcXtalCfg);
    MEM_ZERO_STRUCT(stcUpllCfg);

    /* Use XTAL as UPLL source. */
    stcXtalCfg.enFastStartup = Enable;
    stcXtalCfg.enMode = ClkXtalModeOsc;
    stcXtalCfg.enDrv  = ClkXtalLowDrv;
    CLK_XtalConfig(&stcXtalCfg);
    CLK_XtalCmd(Enable);

